Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: we had to give up using ASSERT* and FAIL* (but not EXPECT* and ADD_FAILURE*) in constructors and destructors.
it_it: abbiamo dovuto rinunciare a utilizzare ASSERT* e FAIL* (ma non EXPECT* e ADD_FAILURE*) nei costruttori e nei distruttori.

source: we had to give up using `ASSERT*` and `FAIL*` (but not `EXPECT*` and `ADD_FAILURE*`) in constructors and destructors.
it_it: abbiamo dovuto rinunciare a utilizzare `ASSERT*` e `FAIL*` (ma non `EXPECT*` e `ADD_FAILURE*`) nei costruttori e nei distruttori.

source: we have:
it_it: abbiamo:

source: what will they return?
it_it: Cosa restituiranno?

source: when argument is passed through dynamic_cast<T>(), it matches matcher m.
it_it: quando argument viene passato attraverso dynamic_cast<T>(), corrisponde al matcher m.

source: when `argument` is passed through `dynamic_cast<T>()`, it matches matcher `m`.
it_it: quando `argument` viene passato attraverso `dynamic_cast<T>()`, corrisponde al matcher `m`.

source: where *`val1`*, *`val2`*, ..., *`valn`* are the values of the predicate arguments, and *`expr1`*, *`expr2`*, ..., *`exprn`* are the corresponding expressions as they appear in the source code.
it_it: dove *`val1`*, *`val2`*, ..., *`valn`* sono i valori degli argomenti del predicato e *`expr1`*, *`expr2`*, ..., *`exprn`* sono le espressioni corrispondenti così come appaiono nel codice sorgente.

source: where val1, val2, ..., valn are the values of the predicate arguments, and expr1, expr2, ..., exprn are the corresponding expressions as they appear in the source code.
it_it: dove val1, val2, ..., valn sono i valori degli argomenti del predicato e expr1, expr2, ..., exprn sono le espressioni corrispondenti così come appaiono nel codice sorgente.

source: where STDMETHODCALLTYPE is defined by <objbase.h> on Windows.
it_it: dove STDMETHODCALLTYPE è definito da <objbase.h> su Windows.

source: where StaticAssertTypeEq is a compile-time assertion in googletest that verifies two types are the same.
it_it: dove StaticAssertTypeEq è un'asserzione in fase di compilazione in googletest che verifica che due tipi siano uguali.

source: where message can be anything streamable to std::ostream.
it_it: dove message può essere qualsiasi cosa accodabile a std::ostream.

source: where u_i is the desired type of v_i.
it_it: dove u_i è il tipo desiderato di v_i.

source: where `STDMETHODCALLTYPE` is defined by `<objbase.h>` on Windows.
it_it: dove `STDMETHODCALLTYPE` è definito da `<objbase.h>` su Windows.

source: where `StaticAssertTypeEq` is a compile-time assertion in googletest that verifies two types are the same.
it_it: dove `StaticAssertTypeEq` è un'asserzione in fase di compilazione in googletest che verifica che due tipi siano uguali.

source: where `message` can be anything streamable to `std::ostream`.
it_it: dove `message` può essere qualsiasi cosa accodabile a `std::ostream`.

source: where `u_i` is the desired type of `v_i`.
it_it: dove `u_i` è il tipo desiderato di `v_i`.

source: where the ts are the template arguments and the vs are the value arguments.
it_it: dove le t sono gli argomenti template e le v sono gli argomenti valore.

source: where the `t`s are the template arguments and the `v`s are the value arguments.
it_it: dove le `t` sono gli argomenti template e le `v` sono gli argomenti valore.

source: where the description string can be either "" or a string expression that references negation and param_name.
it_it: dove la description string può essere "" o un'espressione string che fa riferimento a negation e a param_name.

source: where the description string can be either `""` or a `string` expression that references `negation` and `param_name`.
it_it: dove la description string può essere `""` o un'espressione `string` che fa riferimento a `negation` e a `param_name`.

source: where the descriptions "is divisible by 7" and "not (is divisible by 7)" are automatically calculated from the matcher name IsDivisibleBy7.
it_it: dove le descrizioni "is divisible by 7" e "not (is divisible by 7)" vengono calcolate automaticamente dal nome del matcher IsDivisibleBy7.

source: where the descriptions `"is divisible by 7"` and `"not (is divisible by 7)"` are automatically calculated from the matcher name `IsDivisibleBy7`.
it_it: dove le descrizioni `"is divisible by 7"` e `"not (is divisible by 7)"` vengono calcolate automaticamente dal nome del matcher `IsDivisibleBy7`.

source: which contains the correct sysroot now.
it_it: che ora contiene il sysroot corretto.

source: which is obviously wrong and points to the CBUILD and not CHOST root.
it_it: che è ovviamente sbagliato e punta alla radice di CBUILD e non di CHOST.

source: which is obviously wrong and points to the `CBUILD` and not `CHOST` root.
it_it: che è ovviamente sbagliato e punta alla radice di `CBUILD` e non di `CHOST`.

source: which may lead to this message (assuming n is 10):
it_it: che può portare a questo messaggio (assumendo che n sia 10):

source: which may lead to this message (assuming `n` is 10):
it_it: che può portare a questo messaggio (assumendo che `n` sia 10):

source: will allow you to write
it_it: permetterà di scrivere

source: will allow you to write:
it_it: consentirà di scrivere:

source: will define a matcher with the given name that executes the statements, which must return a bool to indicate if the match succeeds.
it_it: definirà un matcher con il nome dato che esegue le istruzioni, che deve restituire un bool per indicare se la corrispondenza ha successo.

source: will define a matcher with the given name that executes the statements, which must return a `bool` to indicate if the match succeeds.
it_it: definirà un matcher con il nome dato che esegue le istruzioni, che deve restituire un `bool` per indicare se la corrispondenza ha successo.

source: will invoke the N-th (0-based) argument the mock function receives, with arg_1, arg_2, ..., and arg_m.
it_it: invocherà l'N-esimo (0-based) argomento ricevuto dalla funzione mock, con arg_1, arg_2, ..., e arg_m.

source: will invoke the `N`-th (0-based) argument the mock function receives, with `arg_1`, `arg_2`, ..., and `arg_m`.
it_it: invocherà l'`N`-esimo (0-based) argomento ricevuto dalla funzione mock, con `arg_1`, `arg_2`, ..., e `arg_m`.

source: will not generate a compiler error, as Foo<bool>::Bar() is never actually instantiated.
it_it: non genererà un errore del compilatore, poiché Foo<bool>::Bar() non viene mai effettivamente istanziato.

source: will not generate a compiler error, as `Foo<bool>::Bar()` is never actually instantiated.
it_it: non genererà un errore del compilatore, poiché `Foo<bool>::Bar()` non viene mai effettivamente istanziato.

source: will output XML like this:
it_it: restituirà XML in questo modo:

source: with what arguments?
it_it: Con quali argomenti?

source: without worrying that a NULL pointer will crash your test.
it_it: senza preoccuparsi che un puntatore NULL mandi in crash il test.

source: without worrying that a `NULL` pointer will crash your test.
it_it: senza preoccuparsi che un puntatore `NULL` mandi in crash il test.

source: would generate a failure that contains the message:
it_it: genererebbe un errore che contiene il messaggio:

source: would generate a failure that contains the text:
it_it: genererebbe un errore che contiene il testo:

source: you also need to define it *outside* of the class body in `foo.cc`:
it_it: lo si deve definire anche *al di fuori* del corpo della classe in `foo.cc`:

source: you also need to define it outside of the class body in foo.cc:
it_it: lo si deve definire anche al di fuori del corpo della classe in foo.cc:

source: you can simply typedef the test fixtures:
it_it: si può semplicemente avere un typedef delle fixture:

source: you can simply `typedef` the test fixtures:
it_it: si può semplicemente avere un `typedef` delle fixture:

source: you could write
it_it: si può scrivere

source: you want.
it_it: comunque sia.

source: {: .callout .important} IMPORTANT: The exact format of the JSON document is subject to change.
it_it: {: .callout .important} IMPORTANTE: Il formato esatto del documento JSON è soggetto a modifiche.

source: {: .callout .important} IMPORTANT: We strongly recommend you to follow the convention of naming your test suite (not test) *DeathTest when it contains a death test, as demonstrated in the above example.
it_it: {: .callout .important} IMPORTANTE: Consigliamo vivamente di seguire la convenzione di denominare la test suite (not il test) *DeathTest quando contiene un death test, come mostrato nell'esempio precedente.

source: {: .callout .important} IMPORTANT: We strongly recommend you to follow the convention of naming your **test suite** (not test) `*DeathTest` when it contains a death test, as demonstrated in the above example.
it_it: {: .callout .important} IMPORTANTE: Consigliamo vivamente di seguire la convenzione di denominare la **test suite** (not il test) `*DeathTest` quando contiene un death test, come mostrato nell'esempio precedente.

source: {: .callout .note} Note: A mock object is currently naggy by default.
it_it: {: .callout .note} Nota: Un oggetto mock è attualmente naggy per default.

source: {: .callout .note} Note: There might be some confusion arising from different definitions of the terms Test, Test Case and Test Suite, so beware of misunderstanding these.
it_it: {: .callout .note} Nota: Potrebbe verificarsi un po' di confusione derivante dalle diverse definizioni dei termini Test, Test Case e Test Suite, quindi attenzione a non confonderli.

source: {: .callout .note} Note: Why do we use a macro to do this?
it_it: {: .callout .note} Nota: Perché utilizziamo una macro per fare questo?

source: {: .callout .note} Note: Why does gMock search for a match in the reverse order of the expectations?
it_it: {: .callout .note} Nota: Perché gMock cerca una corrispondenza nell'ordine inverso delle expectation?

source: {: .callout .note} Note: Your polymorphic matcher class does not need to inherit from MatcherInterface or any other class, and its methods do not need to be virtual.
it_it: {: .callout .note} Nota: La classe matcher polimorfica non ha bisogno di ereditare da MatcherInterface o qualsiasi altra classe, e i suoi metodi non devono essere virtuali.

source: {: .callout .note} Note: due to technical reasons, DoDefault() cannot be used inside a composite action - trying to do so will result in a run-time error.
it_it: {: .callout .note} Nota: per motivi tecnici, DoDefault() non può essere utilizzato all'interno di un'azione composita: facendolo comporterà un errore a runtime.

source: {: .callout .note} Note: gMock lives in the testing name space.
it_it: {: .callout .note} Nota: gMock risiede nel namespace testing.

source: {: .callout .note} Note: if you don't mock all versions of the overloaded method, the compiler will give you a warning about some methods in the base class being hidden.
it_it: {: .callout .note} Nota: se non si mock-ano tutte le versioni del metodo sovraccaricato, il compilatore darà un warning sul fatto che che alcuni metodi nella classe base sono nascosti.

source: {: .callout .note} NOTE: NiceMock and StrictMock only affects uninteresting calls (calls of methods with no expectations); they do not affect unexpected calls (calls of methods with expectations, but they don't match).
it_it: {: .callout .note} NOTA: NiceMock e StrictMock influenzano solo le chiamate non interessanti (chiamate di metodi senza [expectation]); non influenzano le chiamate unexpected (chiamate di metodi con expectation, ma che non corrispondono).

source: {: .callout .note} NOTE: ParseGUnitFlags() is deprecated in favor of InitGoogleTest().
it_it: {: .callout .note} NOTA: ParseGUnitFlags() è deprecato a favore di InitGoogleTest().

source: {: .callout .note} NOTE: Assertions from multiple threads are currently not supported on Windows.
it_it: {: .callout .note} NOTA: Le asserzioni provenienti da più thread non sono attualmente supportate su Windows.

source: {: .callout .note} NOTE: Constructors and destructors are not considered void-returning functions, according to the C++ language specification, and so you may not use fatal assertions in them; you'll get a compilation error if you try.
it_it: {: .callout .note} NOTA: Costruttori e distruttori non sono considerati funzioni che restituiscono void, secondo le specifiche del linguaggio C++, e quindi non è possibile utilizzare asserzioni fatali al loro interno; provandoci si riceverà un errore di compilazione.

source: {: .callout .note} NOTE: If your test fixture defines SetUpTestSuite() or TearDownTestSuite() they must be declared public rather than protected in order to use TEST_P.
it_it: {: .callout .note} NOTA: Se la fixture definisce SetUpTestSuite() o TearDownTestSuite() devono essere dichiarati public anziché protected per poter utilizzare TEST_P.

source: {: .callout .note} NOTE: In the example below, we assume Clang or GCC and set --cxxopt=-std=c++14 to ensure that GoogleTest is compiled as C++14 instead of the compiler's default setting (which could be C++11).
it_it: {: .callout .note} NOTA: Nell'esempio seguente, assumiamo Clang o GCC e impostiamo --cxxopt=-std=c++14 per garantire che GoogleTest sia compilato come C++14 anziché come il default del compilatore (che potrebbe essere C++11).

source: {: .callout .note} NOTE: The code above must be placed at global or namespace scope, not at function scope.
it_it: {: .callout .note} NOTA: Il codice precedente deve essere inserito nello scope globale o del namespace, non nello scope della funzione.

source: {: .callout .note} NOTE: The section below is legacy documentation from before C++ had lambdas:
it_it: {: .callout .note} NOTA: La sezione seguente è la documentazione di prima che il C++ avesse le lambda:

source: {: .callout .note} NOTE: The type of the value being matched (arg_type) is determined by the context in which you use the matcher and is supplied to you by the compiler, so you don't need to worry about declaring it (nor can you).
it_it: {: .callout .note} NOTA: Il il tipo del valore da abbinare [match] (arg_type) è determinato dal contesto in cui si usa il matcher e viene fornito dal compilatore, quindi non ci si deve preoccupare di dichiararlo (e nemmeno si può).

source: {: .callout .note} NOTE: This feature should only be used for temporary pain-relief.
it_it: {: .callout .note} NOTA: Questa funzione deve essere utilizzata solo come soluzione temporanea.

source: {: .callout .note} NOTE: Though the above code declares SetUpTestSuite() protected, it may sometimes be necessary to declare it public, such as when using it with TEST_P.
it_it: {: .callout .note} NOTA: Sebbene il codice sopra dichiari SetUpTestSuite() protected, a volte potrebbe essere necessario dichiararlo pubblico, come quando lo si utilizza con TEST_P.

source: {: .callout .note} NOTE: test names must be non-empty, unique, and may only contain ASCII alphanumeric characters.
it_it: {: .callout .note} NOTA: i nomi dei test devono essere non vuoti, univoci e possono contenere solo caratteri alfanumerici ASCII.

source: {: .callout .note} Note: AbslStringify() utilizes a generic "sink" buffer to construct its string.
it_it: {: .callout .note} Nota: AbslStringify() usa un generico buffer "sink" per costruire la sua stringa.

source: {: .callout .note} Note: GoogleTest reserves underscore (_) for special-purpose keywords, such as the DISABLED_ prefix, in addition to the following rationale.
it_it: {: .callout .note} Nota: GoogleTest si riserva l'underscore (_) per parole chiave con scopi speciali, come il prefisso DISABLED_, in aggiunta alla motivazione seguente.

source: {: .callout .note} Note: If you want to put a series of test assertions in a subroutine to check for a complex condition, consider using a custom GMock matcher instead.
it_it: {: .callout .note} Nota: Per inserire una serie di asserzioni di test in una subroutine per verificare una condizione complessa, considerare invece l'utilizzo di un matcher GMock personalizzato.

source: {: .callout .note} Note: The terminal commands in this tutorial show a Unix shell prompt, but the commands work on the Windows command line as well.
it_it: {: .callout .note} Nota: I comandi del terminale in questo tutorial mostrano un prompt della shell Unix, ma funzionano anche sulla riga di comando di Windows.

source: {: .callout .note} Note: this example has a downside: namely, if the expectation is not satisfied, our test will run forever.
it_it: {: .callout .note} Nota: questo esempio ha uno svantaggio: ovvero, se la expectation non viene soddisfatta, il test verrà eseguito all'infinito.

source: {: .callout .note} **Note:** A mock object is currently naggy by default.
it_it: {: .callout .note} **Nota:** Un oggetto mock è attualmente naggy per default.

source: {: .callout .note} **Note:** Why do we use a macro to do this?
it_it: {: .callout .note} **Nota:** Perché utilizziamo una macro per fare questo?

source: {: .callout .note} **Note:** Why does gMock search for a match in the *reverse* order of the expectations?
it_it: {: .callout .note} **Nota:** Perché gMock cerca una corrispondenza nell'ordine *inverso* delle expectation?

source: {: .callout .note} **Note:** Your polymorphic matcher class does **not** need to inherit from `MatcherInterface` or any other class, and its methods do **not** need to be virtual.
it_it: {: .callout .note} **Nota:** La classe matcher polimorfica **non** ha bisogno di ereditare da `MatcherInterface` o qualsiasi altra classe, e i suoi metodi **non** devono essere virtuali.

source: {: .callout .note} **Note:** due to technical reasons, `DoDefault()` cannot be used inside a composite action - trying to do so will result in a run-time error.
it_it: {: .callout .note} **Nota:** per motivi tecnici, `DoDefault()` non può essere utilizzato all'interno di un'azione composita: facendolo comporterà un errore a runtime.

source: {: .callout .note} **Note:** gMock lives in the `testing` name space.
it_it: {: .callout .note} **Nota:** gMock risiede nel namespace `testing`.

source: {: .callout .note} **Note:** if you don't mock all versions of the overloaded method, the compiler will give you a warning about some methods in the base class being hidden.
it_it: {: .callout .note} **Nota:** se non si mock-ano tutte le versioni del metodo sovraccaricato, il compilatore darà un warning sul fatto che che alcuni metodi nella classe base sono nascosti.

source: {: .callout .note} *Note:* There might be some confusion arising from different definitions of the terms *Test*, *Test Case* and *Test Suite*, so beware of misunderstanding these.
it_it: {: .callout .note} *Nota:* Potrebbe verificarsi un po' di confusione derivante dalle diverse definizioni dei termini *Test*, *Test Case* e *Test Suite*, quindi attenzione a non confonderli.

source: {: .callout .note} NOTE: If your test fixture defines `SetUpTestSuite()` or `TearDownTestSuite()` they must be declared **public** rather than **protected** in order to use `TEST_P`.
it_it: {: .callout .note} NOTA: Se la fixture definisce `SetUpTestSuite()` o `TearDownTestSuite()` devono essere dichiarati **public** anziché **protected** per poter utilizzare `TEST_P`.

source: {: .callout .note} NOTE: In the example below, we assume Clang or GCC and set `--cxxopt=-std=c++14` to ensure that GoogleTest is compiled as C++14 instead of the compiler's default setting (which could be C++11).
it_it: {: .callout .note} NOTA: Nell'esempio seguente, assumiamo Clang o GCC e impostiamo `--cxxopt=-std=c++14` per garantire che GoogleTest sia compilato come C++14 anziché come il default del compilatore (che potrebbe essere C++11).

source: {: .callout .note} NOTE: The type of the value being matched (`arg_type`) is determined by the context in which you use the matcher and is supplied to you by the compiler, so you don't need to worry about declaring it (nor can you).
it_it: {: .callout .note} NOTA: Il il tipo del valore da abbinare [match] (`arg_type`) è determinato dal contesto in cui si usa il matcher e viene fornito dal compilatore, quindi non ci si deve preoccupare di dichiararlo (e nemmeno si può).

source: {: .callout .note} NOTE: Though the above code declares `SetUpTestSuite()` protected, it may sometimes be necessary to declare it public, such as when using it with `TEST_P`.
it_it: {: .callout .note} NOTA: Sebbene il codice sopra dichiari `SetUpTestSuite()` protected, a volte potrebbe essere necessario dichiararlo pubblico, come quando lo si utilizza con `TEST_P`.

source: {: .callout .note} NOTE: `NiceMock` and `StrictMock` only affects *uninteresting* calls (calls of *methods* with no expectations); they do not affect *unexpected* calls (calls of methods with expectations, but they don't match).
it_it: {: .callout .note} NOTA: `NiceMock` e `StrictMock` influenzano solo le chiamate *non interessanti* (chiamate di *metodi* senza [expectation]); non influenzano le chiamate *unexpected* (chiamate di metodi con expectation, ma che non corrispondono).

source: {: .callout .note} NOTE: `ParseGUnitFlags()` is deprecated in favor of `InitGoogleTest()`.
it_it: {: .callout .note} NOTA: `ParseGUnitFlags()` è deprecato a favore di `InitGoogleTest()`.

source: {: .callout .note} Note: GoogleTest reserves underscore (`_`) for special-purpose keywords, such as [the `DISABLED_` prefix](advanced.md#temporarily-disabling-tests), in addition to the following rationale.
it_it: {: .callout .note} Nota: GoogleTest si riserva l'underscore (`_`) per parole chiave con scopi speciali, come [il prefisso `DISABLED_`](advanced.md#temporarily-disabling-tests), in aggiunta alla motivazione seguente.

source: {: .callout .note} Note: If you want to put a series of test assertions in a subroutine to check for a complex condition, consider using [a custom GMock matcher](gmock_cook_book.md#NewMatchers) instead.
it_it: {: .callout .note} Nota: Per inserire una serie di asserzioni di test in una subroutine per verificare una condizione complessa, considerare invece l'utilizzo di [un matcher GMock personalizzato](gmock_cook_book.md#NewMatchers).

source: {: .callout .note} Note: `AbslStringify()` utilizes a generic "sink" buffer to construct its string.
it_it: {: .callout .note} Nota: `AbslStringify()` usa un generico buffer "sink" per costruire la sua stringa.

source: {: .callout .tip} Tip: It is very common to start with a catch-all expectation for a method and Times(AnyNumber()) (omitting arguments, or with _ for all arguments, if overloaded).
it_it: {: .callout .tip} Tip: È molto comune iniziare con una expectation generale per un metodo e con Times(AnyNumber()) (omettendo gli argomenti, o con _ per tutti gli argomenti, se [overloaded] sovraccaricati).

source: {: .callout .tip} Tip: The Mock::VerifyAndClearExpectations() function returns a bool to indicate whether the verification was successful (true for yes), so you can wrap that function call inside a ASSERT_TRUE() if there is no point going further when the verification has failed.
it_it: {: .callout .tip} Tip: La funzione Mock::VerifyAndClearExpectations() restituisce un bool per indicare se la verifica ha avuto esito positivo (true per sì), quindi si può racchiudere la chiamata alla funzione all'interno di ASSERT_TRUE() se non ha senso andare oltre in caso quando la verifica non è riuscita.

source: {: .callout .tip} TIP: You can easily count the number of disabled tests you have using grep.
it_it: {: .callout .tip} TIP: Si può facilmente contare il numero di test disabilitati con grep.

source: {: .callout .tip} Tip: for convenience, MatchAndExplain() can take a MatchResultListener* instead of std::ostream*.
it_it: {: .callout .tip} Tip: per comodità, MatchAndExplain() può accettare un MatchResultListener* invece di std::ostream*.
